#include "main.h"

void bsp_init(void);

/***********************************************************************
*   函 数 名: main
*   功能说明: 主函数
*   形    参：无
*   返 回 值: 无
***********************************************************************/
void main(void)
{
  bsp_init();
  delay_ms(10);//延时10ms等待初始化完成
  while(1);
}

/***********************************************************************
*   函 数 名: bsp_init
*   功能说明: bsp初始化函数
*   形    参：无
*   返 回 值: 无
***********************************************************************/
void bsp_init(void)
{
    clk_init();//时钟初始化  
    gpio_init();//io初始化
    time2_init();//定时器2初始化
    UART1_Congfiguration();//串口初始化
}




/*断言函数：它的作用是在编程的过程中为程序提供参数检查*/
#ifdef USE_FULL_ASSERT
void assert_failed(u8* file,u32 line)
{
  bsp_init();
  while(1)
  {
  }
}
#endif
