#include "main.h"

/***********************************************************************
*   函 数 名: delay_us
*   功能说明: 提供us级延时函数，4M时钟
*   形    参：无
*   返 回 值: 无
***********************************************************************/
void delay_us(u16 nCount)
{
    while(nCount--)
    {
    asm("nop");
    asm("nop");
    asm("nop");
    asm("nop");
    }
}

/***********************************************************************
*   函 数 名: delay_ms
*   功能说明: 提供ms级延时函数，4M时钟
*   形    参：无
*   返 回 值: 无
***********************************************************************/
void delay_ms(u16 nCount)
{
    while(nCount--)
    {
      delay_us(1000);
    }
}